Tekla Open API Reference for Tekla Structures 2025
Arc Constructor (Point, Vector, Vector, Double, Double)
 Constructs a new arc geometry
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc(
	Point centerPoint,
	Vector startDirection,
	Vector startTangent,
	double radius,
	double deltaAngleRadians
)
Public Sub New (
	centerPoint As Point,
	startDirection As Vector,
	startTangent As Vector,
	radius As Double,
	deltaAngleRadians As Double
)
Parameters
centerPoint
Type: Tekla.Structures.Geometry3d.Point
Center point of the arc.
startDirection
Type: Tekla.Structures.Geometry3d.Vector
Direction vector pointing from the center towards the start point of the arc.
startTangent
Type: Tekla.Structures.Geometry3d.Vector
Vector tangent to the arc at its start point, pointing towards the arc.
radius
Type: System.Double
Radius of the arc
deltaAngleRadians
Type: System.Double
Angle of the arc in radians. From 0 to 2*PI.
Exceptions
Exception | Condition
ArgumentException | Throws when input values are not defined correctly
See Also
Reference
Arc Class
Arc Overload
Tekla.Structures.Geometry3d Namespace